Revit 2027 API
ConnectorManager.UnusedConnectors Property
Return all the unused Connectors of the Connector Manager.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorSet UnusedConnectors { get; }
Public ReadOnly Property UnusedConnectors As ConnectorSet
	Get
public:
property ConnectorSet^ UnusedConnectors {
	ConnectorSet^ get ();
}
member UnusedConnectors : ConnectorSet with get
Property Value
ConnectorSet
Remarks
This property is used to retrieve the unused Connectors from the Connector Manager.
See Also
Reference
ConnectorManager Class
Autodesk.Revit.DB Namespace